Repository: fabiomolinar/website
Catalog: website/*/locale/*/LC_MESSAGES/django.po
Languages: pt

source: There was a problem while accessing the API
pt: Houve um problema ao acessar a API

source: Success
pt: Sucesso

source: About me
pt: Sobre

source: A little about me.
pt: Um pouco sobre mim.

source: Fabio Thomaz Molinar, Fabio Molinar, Blog, Personal site, Projects, Web, Development, IoT, Industry 4.0, Gas Turbines
pt: Fabio Thomaz Molinar, Fabio Molinar, Blog, Site pessoal, Projetos, Web, Desenvolvimento, IoT, Indústria 4.0, Turbinas a Gás

source: IoT, Industry 4.0, Gas Turbines, Utilities, Power, Power generation
pt: IoT, Indústria 4.0, Turbinas a Gás, Utilidades, Energia, Produção de Energia

source: About
pt: Sobre

source: I am an <strong>Automation & Control Engineer</strong> professional who is passionate about technology, control theory and web technologies. In order to be able to play in different control systems, I have learned to develop control theory so that I can deploy it in different control platforms; therefore, becoming platform independent. I value honest and strong partnerships and collaboration. I am an open minded person and I am always looking forward to develop myself technically and as a person as much as developing those around me together in the process. I enjoy developing control software for gas turbines, be it using MarkVIe, RX3i, Micronet, Netmation, T3000 control platforms, you name it. In my current role I really enjoy the openness and range of different possibilities we have to tackle our challenges. Undoubtedly though, I really love to see the software I help creating to spin up the turbine's shaft and produce huge amounts of energy to the power grid!
pt: Sou um <strong>Engenheiro de Control de Turbinas a Gás</strong> e passionado por tecnologia, teoria de controle e aplicações web. Com o intuito de ser capaz de trabalhar com vários tipos diferentes de sistemas de controle, acabei aprendendo a dominar teoria de controle para poder implementá-la em diferentes sistemas de controle. Me tornando assim, independente de qualquer plataforma específica. Dou valor a honestidade, fortes parcerias e colaboração. Sou uma pessoa de mente aberta e estou sempre a procura de me desenvolver tecnicamente e como pessoa, assim como desenvolver aqueles a minha volta. Aprecio desenvolver software de controle para turbinas a gás, seja utilizando MarkVIe, RX3i, Micronet, Netmation, T3000 ou outras plataformas. Na minha atual posição, adoro a liberdade e variedade com a qual temos que lidar para resolver nossos desafios. Mas, sem dúvias, eu gosto mesmo é de ver o software que ajudei a criar a rodar as turbinas a gás e a produzir enormes quantidades de energia para o sistema elétrico.

source: In my time out of the office I am a <strong>web developer geek</strong>. I am fascinated with the power of web technologies to bring people, resources and machines together. At this field I am also able to play with different stacks, both at the front and back end development. I am certainly looking forward for our interconnected future and the revolution that the Internet of Things are probably going to bring. I hope to be part of those helping shaping that change and bringing a better future for generations to come.
pt: No meu tempo fora do escritório sou um <strong>programador web</strong>. Sou fascinado pelo poder das tecnologias web de trazer pessoas, recursos, e máquinas juntos. Nesse campo também sou capaz de trabalhar com vários stacks diferentes, tanto no front-end como no back-end. Sem dúvida, estou ansioso pelo nosso futuro interconectado e pela revolução que a internet das coisas provavelmente irão nos trazer. Espero poder fazer parte daqueles ajudando a formar essa mudança e trazer um melhor futuro para gerações futuras.

source: For more details, take a look at my LinkedIn page.
pt: Para mais detalhes, veja minha página no LinkedIn.

source: Storyline
pt: Linha do tempo

source: Hobbyist
pt: Hobbyista

source: always
pt: sempre

source: Been playing around with PHP, Javascript, Python, Laravel, Android, PhoneGap, Meteor.js, Node.js, Angular, React, Bootstrap.
pt: Trabalhando com PHP, Javascript, Python, Laravel, Android, PhoneGap, Meteor.js, Node.js, Angular, React, Bootstrap.

source: But most recently I decided to settle down and focus all my efforts on Python and its amazing frameworks and libraries. This site and its contents are mostly writte in Python using Django. And its apps are powered by Scrapy, scikit-learn, numpy and pandas.
pt: Mas mais recentemente decidi estabelecer e focar meus esforços no Python e sua coleção impecável de frameworks e bibliotecas. Esse site e seu conteúdo foram escritos quase que exclusivamente em Python usando Django. E seus aplicativos são baseados em Scrapy, scikit-learn, numpy e pandas.

source: Lead Gas Turbines Controls Engineer
pt: Engenheiro de Controle de Turbinas a Gás Pleno

source: today
pt: hoje

source: Engineering Design Center (a General Electric company)
pt: Engineering Design Center (uma empresa General Electric)

source: Poland
pt: Polônia

source: Working for GE Cross-Fleet Gas Turbines Solutions. Responsible to develop control system projects of heavy duty gas turbines from other manufactures (oOEM). Main development done with Diasys Netmation controller for Mitsubishi turbines and T3000 for Siemens turbines.
pt: Trabalhando para a GE Cross-Fleet Gas Turbines Solutions. Responsável por desenvolver projetos de sistemas de controle para turbinas heavy-duty de outros fabricantes (oOEM). Principal foco nos sistemas Diasys Netmation em turbinas Mitsubishi e T3000 em turbinas Siemens.

source: Development of control software for GE Aeroderivative Gas Turbines LM2500, LM6000 and LMS in GAP (MicroNet - Woodward), ToolboxST (MarkVIe - GE) and Proficy Machine Edition (RX3i). Provide customer support on the aforementioned turbine control.
pt: Desenvolvimento do sistema de controle das turbinas aeroderivativas LM2500, LM6000 e LMS da GE usando GAP (Micronet - Woodward), ToolboxST (MarkVIe - GE) e Proficy Machine Edition (RX3i). Responsável também por prover suporte aos clientes com relação a as turbinas já mencionadas.

source: Information Systems Project Management
pt: Gerencimento de Projetos de Sistemas de Informação

source: Co-founder
pt: Co-fundador

source: Brazil
pt: Brasil

source: Web service focused on improving the user experience of restaurants customers and empowering restaurant owners with data and insights to drive their strategy and restaurant improvements.
pt: Serviço web focado em aprimorar a experiência do usuário de restaurantes e fortalecer donos de restaurates com dados e dicas para guiar suas estrataégias e melhorias.

source: The platform collected data from restaurnt users and created especialized reports and feedback to restaurant owners to help driving their improvement.
pt: A plataforma coletava dados dos usuários de restaurantes e criava relatórios especializados e feedback para os donos de restaurantes poderem guiar suas estratégias.

source: Gas Turbines Field Service Engineer
pt: Engenheiro de Campo de Turbinas a Gás

source: Responsible for the project commissioning, system updates and start-up of control and automation systems for rotating machines, mainly turbines, compressors and electric generators of high power for power plants and for the oil & gas industry.
pt: Responsável por comissionar, modificar, atualizar e realizar start-up de sistemas de automação e controle de máquinas rotativas, principalmente turbinas, compressores e geradores de alta potência para usinas elétricas e para o setor de óleo e gás.

source: Mechatronics Engineering
pt: Engenheiro Mecatrônico

source: Germany
pt: Alemanha

source: One year exchange program.
pt: Programa de intercâmbio de um ano.

source: Field of study: mechatronics.
pt: Campo de estudo: mecatrônica.

source: Control and Automation Engineering
pt: Engenharia de Controle e Automação

source: Bachelor of Engineering - Controls and Automation Engineering.
pt: Bacharel em Engenharia - Engenharia de Controle e Automação.

source: Control engineering or control systems engineering is an engineering discipline that applies automatic control theory to design systems with desired behaviors in control environments.
pt: Engenharia de controle e automação é uma disciplina que busca aplicar teoria de controle para desenvolver sistemas com comportamentos desejados em ambientes de controle.

source: Extra activities and societies: junior company, researcher in economics.
pt: Atividades extras: empresa júnior, pesquisador em economia.

source: Thesis: energy control and management in a DC bus supplied by power sources with different electric and dynamic characteristics.
pt: Gerenciamento do fluxo de energia em um barramento alimentado por diferentes fontes.

source: Fabio's personal website. Despite being my hobby, it is also used as a testing environment for my side projects.
pt: Site pessoal do Fabio. Apesar de ser um hobby, também é utilizado como ambiente de teste para meus projetos secundários.

source: Home
pt: Página Inicial

source: Projects
pt: Projetos

source: Contact
pt: Contato

source: Copyright
pt: Direitos autorais

source: How to get in contact with me.
pt: Como entrar em contato comigo.

source: Fabio Thomaz Molinar, Fabio Molinar, Contact
pt: Fabio Thomaz Molinar, Fabio Molinar, Contato

source: Get in touch...
pt: Entre em contato...

source: Hi, I'm Fabio!
pt: Olá, me chamo Fábio.

source: Back-End Web developer, Industrial Automation Engineer, Husband & Father.
pt: Programador Web, Engenheiro de Controle e Automação, Marido & Pai.

source: Welcome to my personal website.
pt: Bem vindo ao meu site pessoal.

source: This is the place where I run some of my personal <a href="%(project_url)s">projects</a> and where my hobbies come to life. It is also where you will find my <a href="%(blog_url)s">blog</a>.
pt: Esse é o local onde se encontram alguns dos meus <a href="%(project_url)s">projetos</a> pessoais e onde tiro meus hobbies do papel. É também o local onde se encontra meu <a href="%(blog_url)s">blog</a>.

source: When I am not at work, when my wife is busy and my children are sleeping, this is the place I come to. :)
pt: É para aqui que venho quando não estou no trabalho, quando minha esposa está ocupada e meus filhos estão dormindo.

source: Website architecture
pt: Arquitetura do site

source: Below an illustrative image of the current state of this website's architecture
pt: Abaixo uma figura ilustrativa da atual arquitetura desse site

source: The green dotted lines represent different Docker containers
pt: Os retângulos verdes com linhas listradas representam diferentes containers Docker

source: You can read more about it on <a href="/blog/trackback/1/">this blog post</a>.
pt: Leia mais sobre isto <a href="/blog/trackback/1/">neste blog post</a>.

source: Translation: a work [always] in progress...
pt: Tradução: um trabalho [sempre] em progresso...

source: I am Brazilian, I have lived and studied in Germany, I currently live in Poland and I am also an Italian citizen.
pt: Sou Brasileiro, morei e estudei na Alemanha, atualmente moro na Polônia e sou também um cidadão Italiano.

source: I had a lot of contact with the German language (used to speak it) and I am aiming to learn Italian. But on my daily basis I use English, Portuguese and Polish to communicate at work and with family/friends.
pt: Eu tive bastante contato com a língua alemã (eu sabia falar alemão) e estou planejando aprender o italiano. Mas no meu dia a dia eu uso o inglês, português e polonês para me comunicar no trabalho e com meus amigos/familiares.

source: Still, translating the entire content of this site takes time and is something I work on sporadically.
pt: Mesmo assim, traduzir todo o conteúdo deste site leva tempo e é algo no qual eu trabalho de forma esporádica.

source: Therefore, expect to:
pt: Sendo assim, expecte:

source: always find the content of this site written in English (the language I have been using the most)
pt: sempre encontrar o conteúdo deste site escrito em inglês (a língua que eu uso com mais frequência)

source: find some content in Portuguese (since I have been testing Django's internationalization package)
pt: encontrar conteúdo parcialmente traduzido para o Português (uma vez que estou a testar a biblioteca de tradução do Django)

source: full support for Portuguese and other languages sometime in the future.
pt: suporte completo para português e outras línguas em algum momento no futuro

source: UX, UI and Web Design
pt: UX, UI e Design Web

source: Not my strong point and not something I am personally curious about. Therefore, when it comes to design, don't expect to find anything more complex than Bootstrap or packaged ready components here.
pt: Não é meu ponto forte nem algo pelo qual sou pessoalmente interessado. Assim sendo, com relação a design, não espere encontrar aqui nada muito mais complexo do que Bootstrap ou componentes de design já preparados.

source: Still, I will try to do my best not to make this site looks like a <a href="http://www.columbia.edu/~fdc/sample.html">plain html site</a>. :)
pt: Mesmo assim, vou fazer o meu melhor para que esse site não pareça um <a href="http://www.columbia.edu/~fdc/sample.html">site em html puro</a>. :)

source: List of the projects I have worked or am working on.
pt: Lista dos projetos no quais trabalhei ou estou trabalhando.

source: List of the projects I have worked/am working on.
pt: Lista dos projetos no quais trabalhei ou estou trabalhando.

source: Featured
pt: Destaque

source: A service that <strong>continuously</strong> collects statistical data about a certain product/category at AliExpress.
pt: Um serviço web que coleta de forma <strong>continua</strong> dados de qualquer produto "procurável" no site AliExpress.

source: View Details
pt: Veja detalhes

source: View Project
pt: Veja o projeto

source: API use - Mentions from Tweets
pt: Uso de APIs - Menções em Tweets

source: A small project that gather the tweets from a Twitter account and list with which other accounts it has been in contact with.
pt: Um pequeno projeto que reune os tweets de um determinado usuário e lista com quais outros usuários ele esteve em contato.

source: This website
pt: Esse site

source: This website is powered by Django and its technology stack include Docker, Nginx and Gunicorn. At least for now.
pt: Esse site é baseado em Django e seu technology stack inclui Docker, Nginx e Gunicorn. Ao menos por enquanto.

source: View Blog Post
pt: Veja o Blog Post

source: My blog
pt: Meu blog

source: I wanted to be able to include a blog to my website without the need to create one from scratch. Django's app structure and Zinnia came in handy so I could achieve just that.
pt: Eu queria ser capaz de incluir um blog dentro do meu site sem ter que criar um do zero. A estrutura em aplicativos do Django e o Zinnia vieram a calhar para que eu conseguisse exatamente isso.

source: View Blog
pt: Veja o Blog

source: Web Scraping - AliExpress Search
pt: Web Scraping - AliExpress

source: A service that collects statistical data about any products/categories searchable at AliExpress.
pt: Um serviço web que coleta dados de qualquer produto "procurável" no site AliExpress.

source: Twitter Mentions
pt: Menções no Twitter

source: Retrieving mentions from someone's Tweets
pt: Coletando menções dos tweets the alguém

source: Twitter, API, Mentions, Friends
pt: Twitter, API, Menções, Amigos

source: Tweets Mentions
pt: Menções em Tweets

source: Retrieving mentions from someone's Tweets.
pt: Coletando menções dos tweets the alguém.

source: How it works
pt: Como funciona

source: Type below the username of a Twitter account.
pt: Digite abaixo o nome de usuário de algum usuário do Twitter.

source: On the background, our server will retrieve the tweets from this account by using Twitter's API and search for any mentions to others that this account has made.
pt: No fundo, o servidor irá coletar os tweets da conta selecionada usando a API do Twitter and fará uma busca por todas as menções a outras contas do Twitter que esse usuário tenha feito.

source: Are all tweets of an account analyzed?
pt: Todos os tweets da conta são analizados?

source: No. Only tweets from the last 31 days are analyzed. And only a maximium of 100 tweets are analyzed.
pt: Não. Apenas os tweets dos últimos 31 dias são analizados. E no máximo 100 tweets são analizados.

source: Are all mentions showed?
pt: Todas as menções são mostradas?

source: No, only the top 10 most frequently mentioned accounts.
pt: Não, apenas as 10 menções mais frequentes.

source: What is the difference between "main" and "answers"?
pt: Qual a diferença entre "principal" e "respostas"?

source: "Main" refers to the tweets that the user wrote or quoted.
pt: "Principal" se refere aos tweets escritos ou citados pelo usuário.

source: "Answers" refers to the tweets that were responses that user wrote.
pt: "Respostas" se refere aos tweets de resposta do usuário.

source: Retweets are not taken into consideration.
pt: Retweets não são levados em consideração.

source: Have questions or would like <strong>additional/new features</strong>?
pt: Tem perguntas ou gostaria de <strong>recursos novos/adicionais</strong>?

source: Get in <a href="%(contact_url)s">contact</a>.
pt: Entre em <a href="%(contact_url)s">contato</a>.

source: Account to analyze
pt: Conta a ser analizada

source: This field is required
pt: Esse campo é obrigatório

source: Run
pt: Pesquisar

source: Searched account:
pt: Conta pesquisada:

source: Too many requests within an hour
pt: Excedido o número máximo de acesso por hora

source: Too many requests within last 24 hours
pt: Excedido o número máximo de acesso nas últimas 24 horas

source: No data found for this account.
pt: Nenhum dado encontrado para essa conta.

source: Only Ajax calls are permitted
pt: Apenas chamadas Ajax são permitidas

source: Only POST requests are permistted
pt: Apenas chamadas do tipo POST são permitidas

source: No text to search provided
pt: Nenhum texto foi fornecido para a pesquisa

source: Invalid search object
pt: Objeto de pesquisa inválido
