Repository: fabiomolinar/website
Catalog: website/ali/locale/*/LC_MESSAGES/django.po
Languages: pt

source: AliExpress Search
pt: Pesquisa no AliExpress

source: Summary data of a search request to AliExpress
pt: Resumo dos dados retornados após uma requisição de pesquisa no AliExpress

source: AliExpress, Data, Statistics, Summary, Automatic
pt: AliExpress, Dados, Estatística, Resumo, Automático

source: Get statistical data collected from the first page of a search performed at AliExpress website.
pt: Veja dados estatísticos coletados da primeira página de resultados de pesquisa feitos no site do AliExpress

source: How it works
pt: Como funciona

source: Define below from which product/category would you like to collect data from AliExpress.
pt: Define abaixo qual tipo de produto/categoria você gostaria de coletar dados do AliExpress

source: On the background, our server will access the AliExpress website, perform the search for your selected product/category, read the data from the <strong>first page</strong> of results and return a summary with statistical data collected from it.
pt: No fundo, nossos servidores acessam o site do AliExpress, fazem uma pesquisa pelo produto/categoria que você selecionou, coletam os dados da <strong>primeira página</strong> de resultados e retornam um resumo com dados estatísticos dos resultados da pesquisa.

source: More details/FAQ
pt: Mais detalhes/FAQ

source: Is data collected from all page results?
pt: Os dados são coletados de todas as páginas de resultados de pesquisa?

source: No. Data is collected only from the first page. That would not be polite to AliExpress and it would overload their server with undesirable requests.
pt: Não. Dados são coletados apenas da primeira página de resultados. Coletar dados de todas as páginas não seria educado com o AliExpress e poderia sobrecarregar o side deles com solicitações indesejadas.

source: Are the results live?
pt: Os resultados são atuais/correntes?

source: They could be. If there aren't any previous search requests for the same category/product, we will run the search live and your results will be current.
pt: Eles podem ser. Se não houver nenhuma requisição pelo mesmo produto/categoria nos últimos 3 dias, faremos a pesquisa na hora e os resultados retornados serão correntes.

source: Now, if your category/product has been already searched in the last 3 days, the cached results will be returned instead. If it has already been searched but the results are older than 3 days, a new search is done and your results will be current.
pt: Agora, se o produto/categoria já tiver sido pesquisado nos últimos 3 dias, os resultados em cache serão retornados. Se a pesquisa já foi feita mas há mais de 3 dias atrás, uma nova pesquisa é feita e os resultados retornados serão correntes.

source: In other words, if your product/category is frequently searched, you may not get live results.
pt: Em outras palavras, se o seu produto/categoria é pesquisado frequentemente, pode ser que os resultados não sejam correntes.

source: But also no results can be older than 3 days.
pt: Mas nenhum resultado será mais velho do que 3 dias.

source: Again, this is done in order to respect the target server.
pt: Novamente, isso é feito para respeitar o servidor alvo.

source: Are any filters used while performing the search?
pt: Algum filtro é utilizado para fazer a pesquisa?

source: No.
pt: Não.

source: Have questions or would like <strong>additional/new features</strong>?
pt: Tem alguma dúvida ou gostaria de <strong>recursos novos/adicionais</strong>?

source: Get in <a href="%(contact_url)s">contact</a>.
pt: Entre em <a href="%(contact_url)s">contato</a>.

source: Text to be searched
pt: Texto a ser pesquisado

source: This field is required
pt: Esse campo é obrigatório

source: Search
pt: Buscar

source: Corrected
pt: Corrigido

source: Calculations done with outliers removed from sample.
pt: Cálculos feitos com os outliers removidos da amostra.

source: Non-corrected
pt: Não-corrigido

source: (Non-corrected - Corrected)
pt: (Não-corrigido - Corrigido)

source: Items being sold
pt: Items à venda

source: Total number of items being sold at AliExpress.
pt: Número total de items à venda no AliExpress.

source: Minimum price
pt: Preço mínimo

source: Mean price
pt: Preço mediano

source: Average price
pt: Preço médio

source: Maximum price
pt: Preço máximo

source: Price - standard deviation
pt: Preço - desvio padrão

source: Sample size
pt: Tamanho da amostra

source: Number of products included in the calculations.<br>For the non-corrected calculation, that's usually the total number of products returned at the <strong>first page</strong> of the AliExpress search results page.
pt: Número de produtos incluídos nos cálculos.<br>Para os cálculos dos dados não corrigidos, esse é geralmente o número total de produtos disponíveis na <strong>primeira página</strong> dos resultados da pesquisa no AliExpress.

source: AliExpress Tracker
pt: Rastreador do AliExpress

source: Tracking data of products from AliExpress
pt: Rastreamento de dados de produtos do AliExpress

source: AliExpress Product Tracker
pt: Rastreador de Produtos do AliExpress

source: Timeseries of data related to products from AliExpress
pt: Série temporal dos dados relacionados a produtos do AliExpress

source: Our server collects data about a predefined product/category from AliExpress daily. This data is collected from AliExpress search results page. This data is shown in a graphical form below.
pt: Nosso servidor coleta dados diariamente de um determinado produto/categoria do AliExpress. Os dados são coletados da página de resultados de busca do AliExpress e são apresentados de forma gráfica abaixo.

source: Searched text:
pt: Texto pesquisado:

source: Retry
pt: Tentar novamente

source: Values in <span style="color:rgb(0,100,80)">green</span> are related to the <span style="color:rgb(0,100,80)">corrected</span> calculations for outliers, whereas the ones in <span style="color:rgb(0,176,246)">blue</span> are <span style="color:rgb(0,176,246)">non-corrected</span>.
pt: Valores em <span style="color:rgb(0,100,80)">verde</span> estão relacionados aos preços <span style="color:rgb(0,100,80)">corrigidos</span>, enquanto os valores em <span style="color:rgb(0,176,246)">azul</span> são <span style="color:rgb(0,176,246)">não corrigidos</span>.

source: Non-corrected only
pt: Não-corrigido apenas

source: Corrected only
pt: Corrigido apenas

source: Both
pt: Ambos

source: Too many requests within an hour
pt: Excedido o número máximo de acesso por hora

source: Too many requests within last 24 hours
pt: Excedido o número máximo de acesso nas últimas 24 horas

source: Collector server error
pt: Erro no servidor collector

source: Collector server timed out
pt: Servidor collector não respondendo

source: No results found
pt: Nenhum resultado encontrado

source: Only Ajax calls are permitted
pt: Apenas requisições do tipo Ajax são permitidas

source: Only POST requests are permistted
pt: Apenas solicitações do tipo POST são permitidas

source: No text to search provided
pt: Um texto para ser pesquisado não foi fornecido

source: Invalid search object
pt: Tipo de dado para pesquisa incorreto
